In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [9]:
ser.loc[2]
ser.iloc[2]
ser.iloc[-1]
# ser.loc[-1], error

2.0

In [10]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
ser2.loc['c']
ser2.iloc[2]
ser2.iloc[-1]

2.0

In [16]:
ser2[:2]
ser2.iloc[:2]

a    0.0
b    1.0
dtype: float64

In [17]:
ser2[:]

a    0.0
b    1.0
c    2.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
# one열에 모두 1을 저장
data['one'] = 1
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [23]:
data['one']
data.loc[:, 'one']=2

In [24]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        2    9     10    11
New York    2   13     14    15

In [25]:
data.iloc[2]=5
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [26]:
# four 열의 값이 5보다 큰 데이터를 추출하시오
data[data['four']>5]

          one  two  three  four
Colorado    2    5      6     7
New York    2   13     14    15

In [27]:
data.loc[data['four']>5]

          one  two  three  four
Colorado    2    5      6     7
New York    2   13     14    15

In [29]:
# three 열 값이 5인 자료를 추출하시오
data[data['three']==5]
data.loc[data['three']==5]

      one  two  three  four
Utah    5    5      5     5

In [35]:
# three 열 값이 5인 자료의 two 열 값을 추출하시오
data[data['three']==5]['two']

Utah    5
Name: two, dtype: int32

In [37]:
data[data['three']==5][['two']]

      two
Utah    5

In [40]:
data.loc[data['three']==5, 'two']=10

In [41]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5   10      5     5
New York    2   13     14    15

In [43]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [44]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [45]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [46]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [52]:
list('bcd')

['b', 'c', 'd']

In [55]:
# df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=['b', 'c', 'd'])
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'),
                   index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [56]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [57]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [59]:
df1

   A
0  1
1  2

In [60]:
df2

   B
0  3
1  4

In [61]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [62]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [63]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [64]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [65]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [72]:
df2['b'].loc[1]
df2['b'][1]
df2.loc[1, 'b']
df2.b[1]

6.0

In [73]:
np.nan # 결측값

nan

In [76]:
# df2['b'][1] = 2
df2['b'][1]=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
df1 + df2
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [81]:
df1.add(df2, fill_value=0) # fill_value=0 : NaN을 0으로 채워라

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [84]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [85]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [87]:
df1.div(2) # df/2
df1.rdiv(2) # 2/df

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [88]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [89]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [94]:
# df1.index
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [95]:
df2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [97]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [98]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [99]:
arr[0]

array([0., 1., 2., 3.])

In [100]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [102]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
ser=frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [105]:
frame-ser

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [106]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [107]:
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [108]:
frame.sub(series2)

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [109]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.676655  0.716241 -2.116243
Ohio   -0.374615  0.694301  0.190466
Texas  -1.006158  0.112140  1.279163
Oregon -0.107513 -0.940028 -1.677025

In [110]:
np.abs(frame) # 절대값

               b         d         e
Utah    0.676655  0.716241  2.116243
Ohio    0.374615  0.694301  0.190466
Texas   1.006158  0.112140  1.279163
Oregon  0.107513  0.940028  1.677025

In [111]:
frame

               b         d         e
Utah   -0.676655  0.716241 -2.116243
Ohio   -0.374615  0.694301  0.190466
Texas  -1.006158  0.112140  1.279163
Oregon -0.107513 -0.940028 -1.677025

In [115]:
# 열 단위로 최대값, 최소값 구해서 차를 출력
# max, min 함수
frame['b'].max()
frame['b'].min()
frame['b'].max()-frame['b'].min()

0.8986446364652578

In [127]:
def f1(x): # f1 함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()
#     print(x)
#     print(x.max())
#     print(x.min())
#     print(x.max()-x.min())
#     print('='*50)
    
frame.apply(f1) # frame에 열 단위로 f1함수를 적용해라

b    0.898645
d    1.656268
e    3.395406
dtype: float64

In [129]:
def f1(x): # f1 함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1, axis='columns') # frame에 열 단위로 f1함수를 적용해라

Utah      2.832484
Ohio      1.068917
Texas     2.285320
Oregon    1.569512
dtype: float64

In [130]:
def f1(x): # f1 함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1, axis=0) # frame에 열 단위로 f1함수를 적용해라, axis=0 기본값

b    0.898645
d    1.656268
e    3.395406
dtype: float64

In [131]:
def f1(x): # f1 함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()

frame.apply(f1, axis=1) # frame에 열 단위로 f1함수를 적용해라

Utah      2.832484
Ohio      1.068917
Texas     2.285320
Oregon    1.569512
dtype: float64

In [136]:
frame

               b         d         e
Utah   -0.676655  0.716241 -2.116243
Ohio   -0.374615  0.694301  0.190466
Texas  -1.006158  0.112140  1.279163
Oregon -0.107513 -0.940028 -1.677025

In [135]:
def f2(x): # f1 함수에 각각의 열들이 하나씩 전달
    return x.max(), x.min()

frame.apply(f2, axis=0) # frame에 열 단위로 f1함수를 적용해라

          b         d         e
0 -0.107513  0.716241  1.279163
1 -1.006158 -0.940028 -2.116243

In [137]:
def f2(x): # f1 함수에 각각의 열들이 하나씩 전달
    return pd.Series([x.max(), x.min()])

frame.apply(f2, axis=0) # frame에 열 단위로 f1함수를 적용해라

          b         d         e
0 -0.107513  0.716241  1.279163
1 -1.006158 -0.940028 -2.116243

In [138]:
def f2(x): # f1 함수에 각각의 열들이 하나씩 전달
    return pd.Series([x.max(), x.min()], index=['max', 'min'])

frame.apply(f2, axis=0) # frame에 열 단위로 f1함수를 적용해라

            b         d         e
max -0.107513  0.716241  1.279163
min -1.006158 -0.940028 -2.116243

In [139]:
frame

               b         d         e
Utah   -0.676655  0.716241 -2.116243
Ohio   -0.374615  0.694301  0.190466
Texas  -1.006158  0.112140  1.279163
Oregon -0.107513 -0.940028 -1.677025

In [140]:
print(f'{-0.676655:.2f}')

-0.68

In [141]:
x=1.161038
print(f'{x:.2f}')

1.16

In [145]:
def my_format(x):
    return f'{x:.2f}'

frame.applymap(my_format)

            b      d      e
Utah    -0.68   0.72  -2.12
Ohio    -0.37   0.69   0.19
Texas   -1.01   0.11   1.28
Oregon  -0.11  -0.94  -1.68

In [149]:
# def my_format(x):
#     return f'{x:.2f}'

# frame['b'].applymap(my_format) # 시리즈에서는 applymap을 사용할 수 없다

def my_format(x):
    return f'{x:.2f}'

frame['b'].map(my_format) # 시리즈에서는 map 함수를 사용하여 각 데이터를 변환

Utah      -0.68
Ohio      -0.37
Texas     -1.01
Oregon    -0.11
Name: b, dtype: object

In [150]:
import seaborn as sns

In [152]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [155]:
print(tips['tip'].max())
print(tips['tip'].min())

10.0
1.0

In [162]:
# def myformat(x):
#     return x.max(), x.min()

# pd.DataFrame(tips['tip']).apply(myformat)
def max_min(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(max_min)

    tip
0  10.0
1   1.0

In [166]:
tips['tip'].max() - tips['tip'].min()

9.0

In [167]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [170]:
frame.sort_index()
frame.sort_index(axis='columns')
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [171]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [174]:
obj.sort_values()
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [175]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [178]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [179]:
obj.sort_values(ascending=False) # NaN은 열외

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [180]:
obj.sort_values(na_position='first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [181]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [184]:
frame.sort_values('a')
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [185]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [187]:
obj.rank()
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [188]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [189]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [196]:
frame.rank() # frame.rank(axis=0)
frame.rank(axis=1)
frame.rank(axis='columns')
# axis=0 : index, axis=1 : columns

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [194]:
frame.rank(axis=1, ascending=False)

     b    a    c
0  1.0  2.0  3.0
1  1.0  3.0  2.0
2  3.0  2.0  1.0
3  1.0  2.0  3.0

In [197]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [198]:
obj.index.is_unique

False

In [199]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.068547 -0.064012  0.869298
a  0.616236  2.222751  0.272216
b -0.251076 -0.762235 -0.521090
b -0.367095 -1.141942 -0.535416
c  1.416959 -0.109812 -0.707217

In [201]:
df.loc['b']

          0         1         2
b -0.251076 -0.762235 -0.521090
b -0.367095 -1.141942 -0.535416

In [202]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [204]:
df.sum()
# axis=0 : index, axis=1 : columns

one    9.25
two   -5.80
dtype: float64

In [207]:
df.sum(axis=0)
df.sum(axis='index')
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [208]:
df.sum(axis='index', skipna=False)

one   NaN
two   NaN
dtype: float64

In [210]:
df
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [211]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [212]:
df.idxmax()

one    b
two    d
dtype: object

In [213]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [216]:
df.describe() # 기술통계
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 268.0+ bytes

In [218]:
pd.read_csv('data/datasets/titanic/train.csv')
# pd.read_csv('../data/datasets/titanic/train.csv') 현재 파일 위치 기준으로 한단계 상위폴더로 이동한 다음 data 폴더로 이동
# pd.read_csv('../../data/datasets/titanic/train.csv') 두단계 상위폴더로 이동 후

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [222]:
df = pd.read_csv('pew.csv')
# df.info()
df.describe()

,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
count,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000
mean,107.222222,154.500000,186.500000,183.444444,171.388889,288.055556,221.666667,177.611111,144.888889,340.055556
std,168.931784,255.172433,309.891869,291.470354,271.144446,458.442436,345.078849,275.679724,205.224952,530.523878
min,1.000000,2.000000,3.000000,4.000000,2.000000,7.000000,3.000000,4.000000,4.000000,8.000000
25%,12.250000,14.750000,17.000000,15.750000,15.000000,34.250000,25.250000,22.500000,23.750000,41.250000
50%,20.000000,27.000000,33.500000,40.000000,34.000000,66.500000,65.500000,48.500000,53.500000,74.500000
75%,170.000000,193.000000,192.000000,198.750000,166.750000,201.500000,128.750000,103.500000,134.250000,294.750000
max,575.000000,869.000000,1064.000000,982.000000,881.000000,1486.000000,949.000000,792.000000,634.000000,1529.000000

In [225]:
# tesla_stock_quandl
df = pd.read_csv('tesla_stock_quandl.csv')
df

,Date,Open,High,Low,Close,Volume,ExDividend,SplitRatio,AdjOpen,AdjHigh,AdjLow,AdjClose,AdjVolume
0,2018-03-27,304.00,304.2700,277.18,279.18,13696168.0,0.0,1.0,304.00,304.2700,277.18,279.18,13696168.0
1,2018-03-26,307.34,307.5900,291.36,304.18,8324639.0,0.0,1.0,307.34,307.5900,291.36,304.18,8324639.0
2,2018-03-23,311.25,311.6100,300.45,301.54,6600538.0,0.0,1.0,311.25,311.6100,300.45,301.54,6600538.0
3,2018-03-22,313.89,318.8200,308.18,309.10,4914307.0,0.0,1.0,313.89,318.8200,308.18,309.10,4914307.0
4,2018-03-21,310.25,322.4400,310.19,316.53,5927881.0,0.0,1.0,310.25,322.4400,310.19,316.53,5927881.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1944,2010-07-06,20.00,20.0000,15.83,16.11,6866900.0,0.0,1.0,20.00,20.0000,15.83,16.11,6866900.0
1945,2010-07-02,23.00,23.1000,18.71,19.20,5139800.0,0.0,1.0,23.00,23.1000,18.71,19.20,5139800.0
1946,2010-07-01,25.00,25.9200,20.27,21.96,8218800.0,0.0,1.0,25.00,25.9200,20.27,21.96,8218800.0
1947,2010-06-30,25.79,30.4192,23.30,23.83,17187100.0,0.0,1.0,25.79,30.4192,23.30,23.83,17187100.0
1948,2010-06-29,19.00,25.0000,17.54,23.89,18766300.0,0.0,1.0,19.00,25.0000,17.54,23.89,18766300.0

In [229]:
df = pd.read_csv('gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [234]:
# df.head()
# df.tail()
# df.info()
# df.columns
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [241]:
# Zimbabwe 데이터만 추출하시오
# df[df['country'] == 'Zimbabwe'].info()
df[df['continent'] == 'Africa'].shape[0]/12

52.0

In [242]:
df[df['continent'] == 'Africa']

       country continent  year  lifeExp       pop    gdpPercap
24     Algeria    Africa  1952   43.077   9279525  2449.008185
25     Algeria    Africa  1957   45.685  10270856  3013.976023
26     Algeria    Africa  1962   48.303  11000948  2550.816880
27     Algeria    Africa  1967   51.407  12760499  3246.991771
28     Algeria    Africa  1972   54.518  14760787  4182.663766
...        ...       ...   ...      ...       ...          ...
1699  Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143   469.709298

[624 rows x 6 columns]

In [287]:
# 1. 기대수명 데이터셋으로 아래의 작업을 수행하시오.
# 1) iloc 속성으로 행 데이터 추출하기
df.iloc[-1]
# 2) loc 속성으로 행 단위 데이터 추출하기
df.loc[:]
# 3) 열 단위로 데이터 추출하기
df['country']
df.country
# 4) 'year', 'pop' 데이터 추출하기
df[['year', 'pop']]
# 5) country continent  year 데이터 추출하기
df[['country', 'continent', 'year']]
# 6) country  year       pop 데이터 추출하기
df[['country', 'year', 'pop']]
# 7) loc, iloc 속성 자유자재로 사용하기
# 출력예시)
#          country  lifeExp    gdpPercap
# 0    Afghanistan   28.801   779.445314
# 99    Bangladesh   43.453   721.186086
# 999     Mongolia   51.253  1226.041130
df.loc[[0, 99, 999], ['country', 'lifeExp', 'gdpPercap']]
# 출력예시)
#         country  lifeExp    gdpPercap
# 10  Afghanistan   42.129   726.734055
# 11  Afghanistan   43.828   974.580338
# 12      Albania   55.230  1601.056136
# 13      Albania   59.280  1942.284244
df[['country', 'lifeExp', 'gdpPercap']].loc[10:13]

        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136
13      Albania   59.280  1942.284244

In [289]:
# 2. 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
# - 10가지 이상의 방법으로 특정한 행과 열을 선택한다.
dfex = pd.DataFrame(np.random.random_sample(25).reshape(5,5), index=['a', 'b', 'c', 'd', 'e'], columns=['ㄱ', 'ㄴ', 'ㄷ', 'ㄹ', 'ㅁ'])
dfex

          ㄱ         ㄴ         ㄷ         ㄹ         ㅁ
a  0.356027  0.866776  0.848089  0.526779  0.845292
b  0.501531  0.830766  0.397069  0.699946  0.121947
c  0.973153  0.943707  0.414888  0.587642  0.877279
d  0.405518  0.508717  0.881222  0.536392  0.863088
e  0.126383  0.947403  0.394199  0.432448  0.481610

In [318]:
dfex.loc['b']
dfex.iloc[1]
dfex.max()
dfex.min()
dfex.loc[['c','e']]
dfex.loc['a']['ㄱ']
dfex.loc[['a'],['ㄱ', 'ㄴ']]
dfex.iloc[[1,2]]
dfex.mean()
dfex.iloc[1:4].loc['b']

ㄱ    0.501531
ㄴ    0.830766
ㄷ    0.397069
ㄹ    0.699946
ㅁ    0.121947
Name: b, dtype: float64